solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWAR_cm33_core0
**                          MIMXRT735SGAWAR_cm33_core1
**                          MIMXRT735SGAWAR_ezhv
**                          MIMXRT735SGAWAR_hifi1
**                          MIMXRT735SGFOA_cm33_core0
**                          MIMXRT735SGFOA_cm33_core1
**                          MIMXRT735SGFOA_ezhv
**                          MIMXRT735SGFOA_hifi1
**                          MIMXRT758SGAWAR_cm33_core0
**                          MIMXRT758SGAWAR_cm33_core1
**                          MIMXRT758SGAWAR_ezhv
**                          MIMXRT758SGAWAR_hifi1
**                          MIMXRT758SGFOA_cm33_core0
**                          MIMXRT758SGFOA_cm33_core1
**                          MIMXRT758SGFOA_ezhv
**                          MIMXRT758SGFOA_hifi1
**                          MIMXRT798SGAWAR_cm33_core0
**                          MIMXRT798SGAWAR_cm33_core1
**                          MIMXRT798SGAWAR_ezhv
**                          MIMXRT798SGAWAR_hifi1
**                          MIMXRT798SGAWAR_hifi4
**                          MIMXRT798SGFOA_cm33_core0
**                          MIMXRT798SGFOA_cm33_core1
**                          MIMXRT798SGFOA_ezhv
**                          MIMXRT798SGFOA_hifi1
**                          MIMXRT798SGFOA_hifi4
**
**     Version:             rev. 2.0, 2024-05-28
**     Build:               b241121
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SYSCON0
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**
** ###################################################################
*/

/*!
 * @file SYSCON0.h
 * @version 2.0
 * @date 2024-05-28
 * @brief CMSIS Peripheral Access Layer for SYSCON0
 *
 * CMSIS Peripheral Access Layer for SYSCON0
 */

#if !defined(SYSCON0_H_)
#define SYSCON0_H_                               /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWAR_cm33_core0) || defined(CPU_MIMXRT735SGFOA_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_cm33_core1) || defined(CPU_MIMXRT735SGFOA_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_ezhv) || defined(CPU_MIMXRT735SGFOA_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_hifi1) || defined(CPU_MIMXRT735SGFOA_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core0) || defined(CPU_MIMXRT758SGFOA_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core1) || defined(CPU_MIMXRT758SGFOA_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_ezhv) || defined(CPU_MIMXRT758SGFOA_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_hifi1) || defined(CPU_MIMXRT758SGFOA_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core0) || defined(CPU_MIMXRT798SGFOA_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core1) || defined(CPU_MIMXRT798SGFOA_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_ezhv) || defined(CPU_MIMXRT798SGFOA_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi1) || defined(CPU_MIMXRT798SGFOA_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi4) || defined(CPU_MIMXRT798SGFOA_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SYSCON0 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON0_Peripheral_Access_Layer SYSCON0 Peripheral Access Layer
 * @{
 */

/** SYSCON0 - Size of Registers Arrays */
#define SYSCON0_GDET_CTRL_1_COUNT                 1u
#define SYSCON0_ELS_AS_UUID_COUNT                 4u

/** SYSCON0 - Register Layout Typedef */
typedef struct {
  __IO uint32_t SEC_CLK_CTRL;                      /**< Security Clock Control, offset: 0x0 */
  __O  uint32_t SEC_CLK_CTRL_SET;                  /**< Security Clock Control Set, offset: 0x4 */
  __O  uint32_t SEC_CLK_CTRL_CLR;                  /**< Security Clock Control Clear, offset: 0x8 */
  __IO uint32_t GDET_CTRL[SYSCON0_GDET_CTRL_1_COUNT]; /**< GDET0 Control, array offset: 0xC, array step: 0x4 */
       uint8_t RESERVED_0[4];
  __IO uint32_t NMISRC;                            /**< NMI Source Select, offset: 0x14 */
       uint8_t RESERVED_1[4];
  __IO uint32_t CTIMERGLOBALSTARTEN;               /**< CTIMER Global Start Enable, offset: 0x1C */
       uint8_t RESERVED_2[16];
  __I  uint32_t FUSEACSTATUS;                      /**< Fuse Access Status, offset: 0x30 */
       uint8_t RESERVED_3[68];
  __IO uint32_t AHBMATPRIO;                        /**< Bus Matrix Priority, offset: 0x78 */
       uint8_t RESERVED_4[4];
  __O  uint32_t RXEVPULSEGEN;                      /**< Receive Event Pulse Generator, offset: 0x80 */
  __IO uint32_t LATCHED_CM33_TXEV;                 /**< Latched Cortex-M33 Transmit Event, offset: 0x84 */
       uint8_t RESERVED_5[8];
  __IO uint32_t SYSTEM_STICK_CALIB;                /**< System Secure Tick Calibration, offset: 0x90 */
  __IO uint32_t SYSTEM_NSTICK_CALIB;               /**< System Non-Secure Tick Calibration, offset: 0x94 */
  __I  uint32_t CPU0_STATUS;                       /**< CPU0 Status, offset: 0x98 */
       uint8_t RESERVED_6[52];
  __IO uint32_t GPIO_PSYNC;                        /**< GPIO Synchronization Stages, offset: 0xD0 */
       uint8_t RESERVED_7[64];
  __IO uint32_t AUTOCLKGATEOVERRIDE0;              /**< Automatic Clock Gate Override, offset: 0x114 */
  __IO uint32_t SRAM_CLKGATE_CTRL;                 /**< SRAM Clock Gating Control, offset: 0x118 */
       uint8_t RESERVED_8[8];
  __IO uint32_t OCOTP_MEM_CTL;                     /**< OCOTP Memory Control, offset: 0x124 */
  __IO uint32_t ELS_MEM_CTL;                       /**< ELS Memory Control, offset: 0x128 */
       uint8_t RESERVED_9[4];
  __IO uint32_t MMU0_MEM_CTRL;                     /**< MMU0 Memory Control, offset: 0x130 */
       uint8_t RESERVED_10[12];
  __IO uint32_t EDMA0_MEM_CTRL;                    /**< eDMA0 Memory Control, offset: 0x140 */
  __IO uint32_t EDMA1_MEM_CTRL;                    /**< eDMA1 Memory Control, offset: 0x144 */
       uint8_t RESERVED_11[4];
  __IO uint32_t ETF_MEM_CTRL;                      /**< ETF Memory Control, offset: 0x14C */
  __IO uint32_t MMU1_MEM_CTRL;                     /**< MMU1 Memory Control, offset: 0x150 */
  __IO uint32_t XSPI0_MEM_CTRL;                    /**< XSPI0 Memory Control, offset: 0x154 */
  __IO uint32_t XSPI1_MEM_CTRL;                    /**< XSPI1 Memory Control, offset: 0x158 */
  __IO uint32_t XSPI0_DATA_MEM_CTRL;               /**< CACHE64_CTRL0 Data Memory Control, offset: 0x15C */
  __IO uint32_t XSPI1_DATA_MEM_CTRL;               /**< CACHE64_CTRL1 Data Memory Control, offset: 0x160 */
  __IO uint32_t NPU_MEM_CTRL;                      /**< NPU Memory Control, offset: 0x164 */
  __IO uint32_t PKC0_MEM_CTRL;                     /**< PKC Memory 0 Control, offset: 0x168 */
  __IO uint32_t PKC1_MEM_CTRL;                     /**< PKC Memory 1 Control, offset: 0x16C */
       uint8_t RESERVED_12[4];
  __IO uint32_t CM33_MEM_DATA_CTRL;                /**< CPU0 Memory Data Control, offset: 0x174 */
  __IO uint32_t CM33_MEM_TAG_CTRL;                 /**< CPU0 Memory Tag Control, offset: 0x178 */
       uint8_t RESERVED_13[140];
  __IO uint32_t HIFI4_MEM_CTL;                     /**< HiFi4 Memory Control, offset: 0x208 */
       uint8_t RESERVED_14[52];
  __IO uint32_t SAI0_MCLK_CTRL;                    /**< SAI0-2 MCLK IO Direction Control, offset: 0x240 */
       uint8_t RESERVED_15[24];
  __IO uint32_t XSPI0_TAG_MEM_CTRL;                /**< CACHE64_CTRL0 Tag Memory Control, offset: 0x25C */
  __IO uint32_t XSPI1_TAG_MEM_CTRL;                /**< CACHE64_CTRL1 Tag Memory Control, offset: 0x260 */
       uint8_t RESERVED_16[28];
  __IO uint32_t COMP_AUTOGATE_EN;                  /**< VDD2_COMP Auto Gating Enable, offset: 0x280 */
       uint8_t RESERVED_17[12];
  __IO uint32_t COMP_DEBUG_HALTED_SEL;             /**< VDD2_COMP Debug Halted Select, offset: 0x290 */
       uint8_t RESERVED_18[108];
  __IO uint32_t DSPSTALL;                          /**< HiFi4 Stall, offset: 0x300 */
  __IO uint32_t OCDHALTONRESET;                    /**< HiFi4 OCDHaltOnReset, offset: 0x304 */
  __I  uint32_t HIFI4_GPR0;                        /**< HiFi4 General Purpose Register 0, offset: 0x308 */
       uint8_t RESERVED_19[8];
  __I  uint32_t HIFI4_GPR1;                        /**< HiFi4 General Purpose Register 1, offset: 0x314 */
  __I  uint32_t HIFI4_GPR2;                        /**< HiFi4 General Purpose Register 2, offset: 0x318 */
  __IO uint32_t DSP_VECT_REMAP;                    /**< HiFi4 DSP Vector Remap, offset: 0x31C */
       uint8_t RESERVED_20[256];
  __IO uint32_t EDMA0_EN0;                         /**< eDMA0 Request Enable 0, offset: 0x420 */
  __IO uint32_t EDMA0_EN1;                         /**< eDMA0 Request Enable 1, offset: 0x424 */
  __IO uint32_t EDMA0_EN2;                         /**< eDMA0 Request Enable 2, offset: 0x428 */
  __IO uint32_t EDMA0_EN3;                         /**< eDMA0 Request Enable 3, offset: 0x42C */
  __IO uint32_t EDMA1_EN0;                         /**< eDMA1 Request Enable 0, offset: 0x430 */
  __IO uint32_t EDMA1_EN1;                         /**< eDMA1 Request Enable 1, offset: 0x434 */
  __IO uint32_t EDMA1_EN2;                         /**< eDMA1 Request Enable 2, offset: 0x438 */
  __IO uint32_t EDMA1_EN3;                         /**< eDMA1 Request Enable 3, offset: 0x43C */
       uint8_t RESERVED_21[448];
  __IO uint32_t AXBS_CTRL;                         /**< AXBS Control, offset: 0x600 */
       uint8_t RESERVED_22[36];
  __IO uint32_t I3C_ASYNC_WAKEUP_CTRL;             /**< I3C Asynchronous Wake-up Control, offset: 0x628 */
       uint8_t RESERVED_23[36];
  __IO uint32_t GRAY_CODE_LSB;                     /**< Gray to Binary Converter - Gray Code [31:0], offset: 0x650 */
  __IO uint32_t GRAY_CODE_MSB;                     /**< Gray to Binary Converter - Gray Code [63:32], offset: 0x654 */
  __I  uint32_t BINARY_CODE_LSB;                   /**< Gray to Binary Converter - Binary Code [31:0], offset: 0x658 */
  __I  uint32_t BINARY_CODE_MSB;                   /**< Gray to Binary Converter - Binary Code [63:32], offset: 0x65C */
       uint8_t RESERVED_24[928];
  __I  uint32_t SEC_BUSY_STATE;                    /**< Secure IP Busy State, offset: 0xA00 */
       uint8_t RESERVED_25[252];
  __I  uint32_t ELS_OTP_LC_STATE;                  /**< Lifecycle State, offset: 0xB00 */
  __I  uint32_t ELS_OTP_LC_STATE_DP;               /**< Lifecycle State, offset: 0xB04 */
  __IO uint32_t ELS_TEMPORAL_STATE;                /**< ELS Temporal State, offset: 0xB08 */
  __IO uint32_t ELS_KDF_MASK;                      /**< Key Derivation Function Mask, offset: 0xB0C */
       uint8_t RESERVED_26[44];
  __I  uint32_t ELS_BOOT_STATE1;                   /**< ELS Boot State 1, offset: 0xB3C */
       uint8_t RESERVED_27[40];
  __IO uint32_t ELS_ASSET_PROT;                    /**< ELS Asset Protection, offset: 0xB68 */
       uint8_t RESERVED_28[84];
  __I  uint32_t ELS_AS_UUID[SYSCON0_ELS_AS_UUID_COUNT]; /**< ELS AS UUID, array offset: 0xBC0, array step: 0x4 */
  __I  uint32_t ELS_AS_CFG0;                       /**< ELS AS Configuration 0, offset: 0xBD0 */
  __I  uint32_t ELS_AS_CFG1;                       /**< ELS AS Configuration 1, offset: 0xBD4 */
       uint8_t RESERVED_29[4];
  __I  uint32_t ELS_AS_CFG3;                       /**< ELS AS Configuration 3, offset: 0xBDC */
  __I  uint32_t ELS_AS_ST0;                        /**< ELS AS State 0, offset: 0xBE0 */
  __I  uint32_t ELS_AS_ST1;                        /**< ELS AS State 1, offset: 0xBE4 */
       uint8_t RESERVED_30[16];
  __I  uint32_t ELS_AS_FLAG0;                      /**< ELS AS Flag 0, offset: 0xBF8 */
  __I  uint32_t ELS_AS_FLAG1;                      /**< ELS AS Flag 1, offset: 0xBFC */
       uint8_t RESERVED_31[560];
  __IO uint32_t CLK_OVERRIDE_RAMPKC;               /**< PKC RAM Clock Override, offset: 0xE30 */
} SYSCON0_Type;

/* ----------------------------------------------------------------------------
   -- SYSCON0 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SYSCON0_Register_Masks SYSCON0 Register Masks
 * @{
 */

