solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_OCOTP_MEM_CTL_SRAM_WLPD_MASK     (0x80U)
#define SYSCON0_OCOTP_MEM_CTL_SRAM_WLPD_SHIFT    (7U)
/*! SRAM_WLPD - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_OCOTP_MEM_CTL_SRAM_WLPD(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_OCOTP_MEM_CTL_SRAM_WLPD_SHIFT)) & SYSCON0_OCOTP_MEM_CTL_SRAM_WLPD_MASK)

#define SYSCON0_OCOTP_MEM_CTL_SRAM_IG_MASK       (0x100U)
#define SYSCON0_OCOTP_MEM_CTL_SRAM_IG_SHIFT      (8U)
/*! SRAM_IG - SRAM Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_OCOTP_MEM_CTL_SRAM_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_OCOTP_MEM_CTL_SRAM_IG_SHIFT)) & SYSCON0_OCOTP_MEM_CTL_SRAM_IG_MASK)
/*! @} */

/*! @name ELS_MEM_CTL - ELS Memory Control */
/*! @{ */

#define SYSCON0_ELS_MEM_CTL_MEM_WLPD_MASK        (0x80U)
#define SYSCON0_ELS_MEM_CTL_MEM_WLPD_SHIFT       (7U)
/*! MEM_WLPD - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_ELS_MEM_CTL_MEM_WLPD(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_MEM_CTL_MEM_WLPD_SHIFT)) & SYSCON0_ELS_MEM_CTL_MEM_WLPD_MASK)

#define SYSCON0_ELS_MEM_CTL_MEM_IG_MASK          (0x100U)
#define SYSCON0_ELS_MEM_CTL_MEM_IG_SHIFT         (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_ELS_MEM_CTL_MEM_IG(x)            (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_MEM_CTL_MEM_IG_SHIFT)) & SYSCON0_ELS_MEM_CTL_MEM_IG_MASK)
/*! @} */

/*! @name MMU0_MEM_CTRL - MMU0 Memory Control */
/*! @{ */

#define SYSCON0_MMU0_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON0_MMU0_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_MMU0_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_MMU0_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_MMU0_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_MMU0_MEM_CTRL_MEM_IG_MASK        (0x100U)
#define SYSCON0_MMU0_MEM_CTRL_MEM_IG_SHIFT       (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_MMU0_MEM_CTRL_MEM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_MMU0_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_MMU0_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name EDMA0_MEM_CTRL - eDMA0 Memory Control */
/*! @{ */

#define SYSCON0_EDMA0_MEM_CTRL_PWR_STDBY_MASK    (0x80U)
#define SYSCON0_EDMA0_MEM_CTRL_PWR_STDBY_SHIFT   (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_EDMA0_MEM_CTRL_PWR_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_EDMA0_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON0_EDMA0_MEM_CTRL_PWR_IG_MASK       (0x100U)
#define SYSCON0_EDMA0_MEM_CTRL_PWR_IG_SHIFT      (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_EDMA0_MEM_CTRL_PWR_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON0_EDMA0_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name EDMA1_MEM_CTRL - eDMA1 Memory Control */
/*! @{ */

#define SYSCON0_EDMA1_MEM_CTRL_PWR_STDBY_MASK    (0x80U)
#define SYSCON0_EDMA1_MEM_CTRL_PWR_STDBY_SHIFT   (7U)
/*! PWR_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_EDMA1_MEM_CTRL_PWR_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_MEM_CTRL_PWR_STDBY_SHIFT)) & SYSCON0_EDMA1_MEM_CTRL_PWR_STDBY_MASK)

#define SYSCON0_EDMA1_MEM_CTRL_PWR_IG_MASK       (0x100U)
#define SYSCON0_EDMA1_MEM_CTRL_PWR_IG_SHIFT      (8U)
/*! PWR_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_EDMA1_MEM_CTRL_PWR_IG(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_MEM_CTRL_PWR_IG_SHIFT)) & SYSCON0_EDMA1_MEM_CTRL_PWR_IG_MASK)
/*! @} */

/*! @name ETF_MEM_CTRL - ETF Memory Control */
/*! @{ */

#define SYSCON0_ETF_MEM_CTRL_MEM_STDBY_MASK      (0x80U)
#define SYSCON0_ETF_MEM_CTRL_MEM_STDBY_SHIFT     (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_ETF_MEM_CTRL_MEM_STDBY(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_ETF_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_ETF_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_ETF_MEM_CTRL_MEM_IG_MASK         (0x100U)
#define SYSCON0_ETF_MEM_CTRL_MEM_IG_SHIFT        (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_ETF_MEM_CTRL_MEM_IG(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON0_ETF_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_ETF_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name MMU1_MEM_CTRL - MMU1 Memory Control */
/*! @{ */

#define SYSCON0_MMU1_MEM_CTRL_MEM_STDBY_MASK     (0x80U)
#define SYSCON0_MMU1_MEM_CTRL_MEM_STDBY_SHIFT    (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_MMU1_MEM_CTRL_MEM_STDBY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_MMU1_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_MMU1_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_MMU1_MEM_CTRL_MEM_IG_MASK        (0x100U)
#define SYSCON0_MMU1_MEM_CTRL_MEM_IG_SHIFT       (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_MMU1_MEM_CTRL_MEM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_MMU1_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_MMU1_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name XSPI0_MEM_CTRL - XSPI0 Memory Control */
/*! @{ */

#define SYSCON0_XSPI0_MEM_CTRL_MEM_STDBY_MASK    (0x80U)
#define SYSCON0_XSPI0_MEM_CTRL_MEM_STDBY_SHIFT   (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_MEM_CTRL_MEM_STDBY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI0_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI0_MEM_CTRL_MEM_WIG_MASK      (0x100U)
#define SYSCON0_XSPI0_MEM_CTRL_MEM_WIG_SHIFT     (8U)
/*! MEM_WIG - Memory Write Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_MEM_CTRL_MEM_WIG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_MEM_CTRL_MEM_WIG_SHIFT)) & SYSCON0_XSPI0_MEM_CTRL_MEM_WIG_MASK)

#define SYSCON0_XSPI0_MEM_CTRL_MEM_RIG_MASK      (0x200U)
#define SYSCON0_XSPI0_MEM_CTRL_MEM_RIG_SHIFT     (9U)
/*! MEM_RIG - Memory Read Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_MEM_CTRL_MEM_RIG(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_MEM_CTRL_MEM_RIG_SHIFT)) & SYSCON0_XSPI0_MEM_CTRL_MEM_RIG_MASK)
/*! @} */

