solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_HIFI4_MEM_CTL_MEM_IG_MASK        (0x100U)
#define SYSCON0_HIFI4_MEM_CTL_MEM_IG_SHIFT       (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_HIFI4_MEM_CTL_MEM_IG(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_MEM_CTL_MEM_IG_SHIFT)) & SYSCON0_HIFI4_MEM_CTL_MEM_IG_MASK)
/*! @} */

/*! @name SAI0_MCLK_CTRL - SAI0-2 MCLK IO Direction Control */
/*! @{ */

#define SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR_MASK   (0x1U)
#define SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR_SHIFT  (0U)
/*! SAIMCLKDIR - SAI0-2 MCLK Direction Control
 *  0b0..Input
 *  0b1..Output
 */
#define SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR_SHIFT)) & SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR_MASK)
/*! @} */

/*! @name XSPI0_TAG_MEM_CTRL - CACHE64_CTRL0 Tag Memory Control */
/*! @{ */

#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_STDBY_MASK (0x80U)
#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_STDBY_SHIFT (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_STDBY(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_IG_MASK   (0x100U)
#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_IG_SHIFT  (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_IG(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_XSPI0_TAG_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name XSPI1_TAG_MEM_CTRL - CACHE64_CTRL1 Tag Memory Control */
/*! @{ */

#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_STDBY_MASK (0x80U)
#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_STDBY_SHIFT (7U)
/*! MEM_STDBY - Memory Standby Mode
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_STDBY(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_STDBY_SHIFT)) & SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_STDBY_MASK)

#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_IG_MASK   (0x100U)
#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_IG_SHIFT  (8U)
/*! MEM_IG - Memory Input Gating
 *  0b0..Inactive
 *  0b1..Active
 */
#define SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_IG(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_IG_SHIFT)) & SYSCON0_XSPI1_TAG_MEM_CTRL_MEM_IG_MASK)
/*! @} */

/*! @name COMP_AUTOGATE_EN - VDD2_COMP Auto Gating Enable */
/*! @{ */

#define SYSCON0_COMP_AUTOGATE_EN_MBUS_EN_MASK    (0x1U)
#define SYSCON0_COMP_AUTOGATE_EN_MBUS_EN_SHIFT   (0U)
/*! MBUS_EN - Automatic Clock Gating Enable for M-bus
 *  0b0..Disables clock gating (continuous clock)
 *  0b1..Enables clock gating
 */
#define SYSCON0_COMP_AUTOGATE_EN_MBUS_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_COMP_AUTOGATE_EN_MBUS_EN_SHIFT)) & SYSCON0_COMP_AUTOGATE_EN_MBUS_EN_MASK)

#define SYSCON0_COMP_AUTOGATE_EN_PBUS_EN_MASK    (0x2U)
#define SYSCON0_COMP_AUTOGATE_EN_PBUS_EN_SHIFT   (1U)
/*! PBUS_EN - Automatic Clock Gating Enable for P-bus
 *  0b0..Disables clock gating (continuous clock)
 *  0b1..Enables clock gating
 */
#define SYSCON0_COMP_AUTOGATE_EN_PBUS_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_COMP_AUTOGATE_EN_PBUS_EN_SHIFT)) & SYSCON0_COMP_AUTOGATE_EN_PBUS_EN_MASK)

#define SYSCON0_COMP_AUTOGATE_EN_BRIDGE_EN_MASK  (0x4U)
#define SYSCON0_COMP_AUTOGATE_EN_BRIDGE_EN_SHIFT (2U)
/*! BRIDGE_EN - Automatic Clock Gating Enable for AHB2APB bridge, AIPS and AXBS
 *  0b0..Disables clock gating (continuous clock)
 *  0b1..Enables clock gating
 */
#define SYSCON0_COMP_AUTOGATE_EN_BRIDGE_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_COMP_AUTOGATE_EN_BRIDGE_EN_SHIFT)) & SYSCON0_COMP_AUTOGATE_EN_BRIDGE_EN_MASK)
/*! @} */

/*! @name COMP_DEBUG_HALTED_SEL - VDD2_COMP Debug Halted Select */
/*! @{ */

#define SYSCON0_COMP_DEBUG_HALTED_SEL_WWDT1_SEL_MASK (0x1U)
#define SYSCON0_COMP_DEBUG_HALTED_SEL_WWDT1_SEL_SHIFT (0U)
/*! WWDT1_SEL - WWDT1 Select
 *  0b0..XOCD mode from HiFi4 will be used for WWDT1
 *  0b1..HALTED from CPU0 will be used for WWDT1
 */
#define SYSCON0_COMP_DEBUG_HALTED_SEL_WWDT1_SEL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_COMP_DEBUG_HALTED_SEL_WWDT1_SEL_SHIFT)) & SYSCON0_COMP_DEBUG_HALTED_SEL_WWDT1_SEL_MASK)

#define SYSCON0_COMP_DEBUG_HALTED_SEL_CDOG2_SEL_MASK (0x2U)
#define SYSCON0_COMP_DEBUG_HALTED_SEL_CDOG2_SEL_SHIFT (1U)
/*! CDOG2_SEL - CDOG2 Select
 *  0b0..XOCD mode from HiFi4 will be used for CDOG2
 *  0b1..HALTED from CPU0 will be used for CDOG2
 */
#define SYSCON0_COMP_DEBUG_HALTED_SEL_CDOG2_SEL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_COMP_DEBUG_HALTED_SEL_CDOG2_SEL_SHIFT)) & SYSCON0_COMP_DEBUG_HALTED_SEL_CDOG2_SEL_MASK)
/*! @} */

/*! @name DSPSTALL - HiFi4 Stall */
/*! @{ */

#define SYSCON0_DSPSTALL_DSPSTALL_MASK           (0x1U)
#define SYSCON0_DSPSTALL_DSPSTALL_SHIFT          (0U)
/*! DSPSTALL - Run and Stall Control
 *  0b0..Run (normal mode)
 *  0b1..Stall mode
 */
#define SYSCON0_DSPSTALL_DSPSTALL(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON0_DSPSTALL_DSPSTALL_SHIFT)) & SYSCON0_DSPSTALL_DSPSTALL_MASK)
/*! @} */

/*! @name OCDHALTONRESET - HiFi4 OCDHaltOnReset */
/*! @{ */

#define SYSCON0_OCDHALTONRESET_OCDHALTONRESET_MASK (0x1U)
#define SYSCON0_OCDHALTONRESET_OCDHALTONRESET_SHIFT (0U)
/*! OCDHALTONRESET - OCDHaltOnReset
 *  0b0..Allow normal operation when HiFi4 exits reset (starts fetching and executing instructions from memory)
 *  0b1..Force HiFi4 to enter OCD Halt mode when HiFi4 exits reset
 */
#define SYSCON0_OCDHALTONRESET_OCDHALTONRESET(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_OCDHALTONRESET_OCDHALTONRESET_SHIFT)) & SYSCON0_OCDHALTONRESET_OCDHALTONRESET_MASK)
/*! @} */

/*! @name HIFI4_GPR0 - HiFi4 General Purpose Register 0 */
/*! @{ */

#define SYSCON0_HIFI4_GPR0_PFAULTINFOVLD_MASK    (0x1U)
#define SYSCON0_HIFI4_GPR0_PFAULTINFOVLD_SHIFT   (0U)
/*! PFAULTINFOVLD - PFaultInfoValid
 *  0b0..Not asserted
 *  0b1..Asserted
 */
#define SYSCON0_HIFI4_GPR0_PFAULTINFOVLD(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_GPR0_PFAULTINFOVLD_SHIFT)) & SYSCON0_HIFI4_GPR0_PFAULTINFOVLD_MASK)

#define SYSCON0_HIFI4_GPR0_PFATALERR_MASK        (0x2U)
#define SYSCON0_HIFI4_GPR0_PFATALERR_SHIFT       (1U)
/*! PFATALERR - PFatalError
 *  0b0..No error occurs
 *  0b1..Error occurs
 */
#define SYSCON0_HIFI4_GPR0_PFATALERR(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_GPR0_PFATALERR_SHIFT)) & SYSCON0_HIFI4_GPR0_PFATALERR_MASK)

#define SYSCON0_HIFI4_GPR0_EXCEPTIONERR_MASK     (0x4U)
#define SYSCON0_HIFI4_GPR0_EXCEPTIONERR_SHIFT    (2U)
/*! EXCEPTIONERR - DoubleExceptionError
 *  0b0..No error occurs
 *  0b1..Error occurs
 */
#define SYSCON0_HIFI4_GPR0_EXCEPTIONERR(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_GPR0_EXCEPTIONERR_SHIFT)) & SYSCON0_HIFI4_GPR0_EXCEPTIONERR_MASK)
/*! @} */

/*! @name HIFI4_GPR1 - HiFi4 General Purpose Register 1 */
/*! @{ */

#define SYSCON0_HIFI4_GPR1_PFAULTINFO_MASK       (0xFFFFFFFFU)
#define SYSCON0_HIFI4_GPR1_PFAULTINFO_SHIFT      (0U)
/*! PFAULTINFO - PFaultInfo */
#define SYSCON0_HIFI4_GPR1_PFAULTINFO(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_GPR1_PFAULTINFO_SHIFT)) & SYSCON0_HIFI4_GPR1_PFAULTINFO_MASK)
/*! @} */

