solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
/*! @name HIFI4_GPR2 - HiFi4 General Purpose Register 2 */
/*! @{ */

#define SYSCON0_HIFI4_GPR2_TIE_EXPSTATE_MASK     (0xFFFFFFFFU)
#define SYSCON0_HIFI4_GPR2_TIE_EXPSTATE_SHIFT    (0U)
/*! TIE_EXPSTATE - GPIO32 Option TIE Output State */
#define SYSCON0_HIFI4_GPR2_TIE_EXPSTATE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_HIFI4_GPR2_TIE_EXPSTATE_SHIFT)) & SYSCON0_HIFI4_GPR2_TIE_EXPSTATE_MASK)
/*! @} */

/*! @name DSP_VECT_REMAP - HiFi4 DSP Vector Remap */
/*! @{ */

#define SYSCON0_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK (0x1FFFU)
#define SYSCON0_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT (0U)
/*! DSP_VECT_REMAP - DSP Vector Remap */
#define SYSCON0_DSP_VECT_REMAP_DSP_VECT_REMAP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_DSP_VECT_REMAP_DSP_VECT_REMAP_SHIFT)) & SYSCON0_DSP_VECT_REMAP_DSP_VECT_REMAP_MASK)

#define SYSCON0_DSP_VECT_REMAP_STATVECSELECT_MASK (0x2000U)
#define SYSCON0_DSP_VECT_REMAP_STATVECSELECT_SHIFT (13U)
/*! STATVECSELECT - HiFi4 Remap Function Enable
 *  0b0..Remap function disabled
 *  0b1..Remap function enabled
 */
#define SYSCON0_DSP_VECT_REMAP_STATVECSELECT(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_DSP_VECT_REMAP_STATVECSELECT_SHIFT)) & SYSCON0_DSP_VECT_REMAP_STATVECSELECT_MASK)
/*! @} */

/*! @name EDMA0_EN0 - eDMA0 Request Enable 0 */
/*! @{ */

#define SYSCON0_EDMA0_EN0_MICFIL_EN_MASK         (0x2U)
#define SYSCON0_EDMA0_EN0_MICFIL_EN_SHIFT        (1U)
/*! MICFIL_EN - MICFIL Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_MICFIL_EN(x)           (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_MICFIL_EN_SHIFT)) & SYSCON0_EDMA0_EN0_MICFIL_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI0_RX_EN_MASK       (0x4U)
#define SYSCON0_EDMA0_EN0_XSPI0_RX_EN_SHIFT      (2U)
/*! XSPI0_RX_EN - XSPI0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI0_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI0_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI0_RX_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI0_TX_EN_MASK       (0x8U)
#define SYSCON0_EDMA0_EN0_XSPI0_TX_EN_SHIFT      (3U)
/*! XSPI0_TX_EN - XSPI0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI0_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI0_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI0_TX_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI1_RX_EN_MASK       (0x10U)
#define SYSCON0_EDMA0_EN0_XSPI1_RX_EN_SHIFT      (4U)
/*! XSPI1_RX_EN - XSPI1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI1_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI1_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI1_RX_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI1_TX_EN_MASK       (0x20U)
#define SYSCON0_EDMA0_EN0_XSPI1_TX_EN_SHIFT      (5U)
/*! XSPI1_TX_EN - XSPI1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI1_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI1_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI1_TX_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI2_RX_EN_MASK       (0x40U)
#define SYSCON0_EDMA0_EN0_XSPI2_RX_EN_SHIFT      (6U)
/*! XSPI2_RX_EN - XSPI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI2_RX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI2_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI2_RX_EN_MASK)

#define SYSCON0_EDMA0_EN0_XSPI2_TX_EN_MASK       (0x80U)
#define SYSCON0_EDMA0_EN0_XSPI2_TX_EN_SHIFT      (7U)
/*! XSPI2_TX_EN - XSPI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_XSPI2_TX_EN(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_XSPI2_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN0_XSPI2_TX_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ0_EN_MASK     (0x100U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ0_EN_SHIFT    (8U)
/*! PINT0_IRQ0_EN - PINT0 Interrupt 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ0_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ0_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ1_EN_MASK     (0x200U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ1_EN_SHIFT    (9U)
/*! PINT0_IRQ1_EN - PINT0 Interrupt 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ1_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ1_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ2_EN_MASK     (0x400U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ2_EN_SHIFT    (10U)
/*! PINT0_IRQ2_EN - PINT0 Interrupt 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ2_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ2_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ2_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ3_EN_MASK     (0x800U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ3_EN_SHIFT    (11U)
/*! PINT0_IRQ3_EN - PINT0 Interrupt 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ3_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ3_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ3_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ4_EN_MASK     (0x1000U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ4_EN_SHIFT    (12U)
/*! PINT0_IRQ4_EN - PINT0 Interrupt 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ4_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ4_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ4_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ5_EN_MASK     (0x2000U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ5_EN_SHIFT    (13U)
/*! PINT0_IRQ5_EN - PINT0 Interrupt 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ5_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ5_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ5_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ6_EN_MASK     (0x4000U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ6_EN_SHIFT    (14U)
/*! PINT0_IRQ6_EN - PINT0 Interrupt 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ6_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ6_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ6_EN_MASK)

#define SYSCON0_EDMA0_EN0_PINT0_IRQ7_EN_MASK     (0x8000U)
#define SYSCON0_EDMA0_EN0_PINT0_IRQ7_EN_SHIFT    (15U)
/*! PINT0_IRQ7_EN - PINT0 Interrupt 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN0_PINT0_IRQ7_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN0_PINT0_IRQ7_EN_SHIFT)) & SYSCON0_EDMA0_EN0_PINT0_IRQ7_EN_MASK)

