solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA0_EN1_SDADC_FIFO3_EN_MASK    (0x2U)
#define SYSCON0_EDMA0_EN1_SDADC_FIFO3_EN_SHIFT   (1U)
/*! SDADC_FIFO3_EN - SDADC FIFO3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_SDADC_FIFO3_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_SDADC_FIFO3_EN_SHIFT)) & SYSCON0_EDMA0_EN1_SDADC_FIFO3_EN_MASK)

#define SYSCON0_EDMA0_EN1_ACMP_EN_MASK           (0x4U)
#define SYSCON0_EDMA0_EN1_ACMP_EN_SHIFT          (2U)
/*! ACMP_EN - ACMP0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_ACMP_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_ACMP_EN_SHIFT)) & SYSCON0_EDMA0_EN1_ACMP_EN_MASK)

#define SYSCON0_EDMA0_EN1_ITRC_TAMPER0_EN_MASK   (0x8U)
#define SYSCON0_EDMA0_EN1_ITRC_TAMPER0_EN_SHIFT  (3U)
/*! ITRC_TAMPER0_EN - ITRC Tamper 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_ITRC_TAMPER0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_ITRC_TAMPER0_EN_SHIFT)) & SYSCON0_EDMA0_EN1_ITRC_TAMPER0_EN_MASK)

#define SYSCON0_EDMA0_EN1_ITRC_TAMPER1_EN_MASK   (0x10U)
#define SYSCON0_EDMA0_EN1_ITRC_TAMPER1_EN_SHIFT  (4U)
/*! ITRC_TAMPER1_EN - ITRC Tamper 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_ITRC_TAMPER1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_ITRC_TAMPER1_EN_SHIFT)) & SYSCON0_EDMA0_EN1_ITRC_TAMPER1_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER0_EN_MASK (0x20U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER0_EN_SHIFT (5U)
/*! FLEXIO_SHFT_TIMER0_EN - FLEXIO Shift Timer 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER0_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER0_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER0_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER1_EN_MASK (0x40U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER1_EN_SHIFT (6U)
/*! FLEXIO_SHFT_TIMER1_EN - FLEXIO Shift Timer 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER1_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER1_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER1_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER2_EN_MASK (0x80U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER2_EN_SHIFT (7U)
/*! FLEXIO_SHFT_TIMER2_EN - FLEXIO Shift Timer 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER2_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER2_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER2_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER3_EN_MASK (0x100U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER3_EN_SHIFT (8U)
/*! FLEXIO_SHFT_TIMER3_EN - FLEXIO Shift Timer 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER3_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER3_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER3_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER4_EN_MASK (0x200U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER4_EN_SHIFT (9U)
/*! FLEXIO_SHFT_TIMER4_EN - FLEXIO Shift Timer 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER4_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER4_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER4_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER5_EN_MASK (0x400U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER5_EN_SHIFT (10U)
/*! FLEXIO_SHFT_TIMER5_EN - FLEXIO Shift Timer 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER5_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER5_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER5_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER6_EN_MASK (0x800U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER6_EN_SHIFT (11U)
/*! FLEXIO_SHFT_TIMER6_EN - FLEXIO Shift Timer 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER6_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER6_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER6_EN_MASK)

#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER7_EN_MASK (0x1000U)
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER7_EN_SHIFT (12U)
/*! FLEXIO_SHFT_TIMER7_EN - FLEXIO Shift Timer 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER7_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER7_EN_SHIFT)) & SYSCON0_EDMA0_EN1_FLEXIO_SHFT_TIMER7_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_RX_EN_MASK (0x2000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_RX_EN_SHIFT (13U)
/*! LP_FLEXCOMM0_RX_EN - LP_FLEXCOMM0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_TX_EN_MASK (0x4000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_TX_EN_SHIFT (14U)
/*! LP_FLEXCOMM0_TX_EN - LP_FLEXCOMM0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM0_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_RX_EN_MASK (0x8000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_RX_EN_SHIFT (15U)
/*! LP_FLEXCOMM1_RX_EN - LP_FLEXCOMM1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_TX_EN_MASK (0x10000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_TX_EN_SHIFT (16U)
/*! LP_FLEXCOMM1_TX_EN - LP_FLEXCOMM1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM1_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_RX_EN_MASK (0x20000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_RX_EN_SHIFT (17U)
/*! LP_FLEXCOMM2_RX_EN - LP_FLEXCOMM2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_TX_EN_MASK (0x40000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_TX_EN_SHIFT (18U)
/*! LP_FLEXCOMM2_TX_EN - LP_FLEXCOMM2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM2_TX_EN_MASK)

