solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_RX_EN_MASK (0x80000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_RX_EN_SHIFT (19U)
/*! LP_FLEXCOMM3_RX_EN - LP_FLEXCOMM3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_TX_EN_MASK (0x100000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_TX_EN_SHIFT (20U)
/*! LP_FLEXCOMM3_TX_EN - LP_FLEXCOMM3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM3_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_RX_EN_MASK (0x200000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_RX_EN_SHIFT (21U)
/*! LP_FLEXCOMM4_RX_EN - LP_FLEXCOMM4 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_TX_EN_MASK (0x400000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_TX_EN_SHIFT (22U)
/*! LP_FLEXCOMM4_TX_EN - LP_FLEXCOMM4 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM4_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_RX_EN_MASK (0x800000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_RX_EN_SHIFT (23U)
/*! LP_FLEXCOMM5_RX_EN - LP_FLEXCOMM5 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_TX_EN_MASK (0x1000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_TX_EN_SHIFT (24U)
/*! LP_FLEXCOMM5_TX_EN - LP_FLEXCOMM5 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM5_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_RX_EN_MASK (0x2000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_RX_EN_SHIFT (25U)
/*! LP_FLEXCOMM6_RX_EN - LP_FLEXCOMM6 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_TX_EN_MASK (0x4000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_TX_EN_SHIFT (26U)
/*! LP_FLEXCOMM6_TX_EN - LP_FLEXCOMM6 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM6_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_RX_EN_MASK (0x8000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_RX_EN_SHIFT (27U)
/*! LP_FLEXCOMM7_RX_EN - LP_FLEXCOMM7 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_TX_EN_MASK (0x10000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_TX_EN_SHIFT (28U)
/*! LP_FLEXCOMM7_TX_EN - LP_FLEXCOMM7 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM7_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_RX_EN_MASK (0x20000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_RX_EN_SHIFT (29U)
/*! LP_FLEXCOMM8_RX_EN - LP_FLEXCOMM8 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_RX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_TX_EN_MASK (0x40000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_TX_EN_SHIFT (30U)
/*! LP_FLEXCOMM8_TX_EN - LP_FLEXCOMM8 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM8_TX_EN_MASK)

#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM9_RX_EN_MASK (0x80000000U)
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM9_RX_EN_SHIFT (31U)
/*! LP_FLEXCOMM9_RX_EN - LP_FLEXCOMM9 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN1_LP_FLEXCOMM9_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN1_LP_FLEXCOMM9_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN1_LP_FLEXCOMM9_RX_EN_MASK)
/*! @} */

/*! @name EDMA0_EN2 - eDMA0 Request Enable 2 */
/*! @{ */

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM9_TX_EN_MASK (0x1U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM9_TX_EN_SHIFT (0U)
/*! LP_FLEXCOMM9_TX_EN - LP_FLEXCOMM9 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM9_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM9_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM9_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_RX_EN_MASK (0x2U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_RX_EN_SHIFT (1U)
/*! LP_FLEXCOMM10_RX_EN - LP_FLEXCOMM10 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_TX_EN_MASK (0x4U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_TX_EN_SHIFT (2U)
/*! LP_FLEXCOMM10_TX_EN - LP_FLEXCOMM10 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM10_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_RX_EN_MASK (0x8U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_RX_EN_SHIFT (3U)
/*! LP_FLEXCOMM11_RX_EN - LP_FLEXCOMM11 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_TX_EN_MASK (0x10U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_TX_EN_SHIFT (4U)
/*! LP_FLEXCOMM11_TX_EN - LP_FLEXCOMM11 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM11_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_RX_EN_MASK (0x20U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_RX_EN_SHIFT (5U)
/*! LP_FLEXCOMM12_RX_EN - LP_FLEXCOMM12 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_TX_EN_MASK (0x40U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_TX_EN_SHIFT (6U)
/*! LP_FLEXCOMM12_TX_EN - LP_FLEXCOMM12 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM12_TX_EN_MASK)

