solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_RX_EN_MASK (0x80U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_RX_EN_SHIFT (7U)
/*! LP_FLEXCOMM13_RX_EN - LP_FLEXCOMM13 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_TX_EN_MASK (0x100U)
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_TX_EN_SHIFT (8U)
/*! LP_FLEXCOMM13_TX_EN - LP_FLEXCOMM13 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LP_FLEXCOMM13_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LPSPI14_RX_EN_MASK     (0x200U)
#define SYSCON0_EDMA0_EN2_LPSPI14_RX_EN_SHIFT    (9U)
/*! LPSPI14_RX_EN - LPSPI14 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LPSPI14_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LPSPI14_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LPSPI14_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LPSPI14_TX_EN_MASK     (0x400U)
#define SYSCON0_EDMA0_EN2_LPSPI14_TX_EN_SHIFT    (10U)
/*! LPSPI14_TX_EN - LPSPI14 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LPSPI14_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LPSPI14_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LPSPI14_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LPSPI16_RX_EN_MASK     (0x800U)
#define SYSCON0_EDMA0_EN2_LPSPI16_RX_EN_SHIFT    (11U)
/*! LPSPI16_RX_EN - LPSPI16 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LPSPI16_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LPSPI16_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LPSPI16_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_LPSPI16_TX_EN_MASK     (0x1000U)
#define SYSCON0_EDMA0_EN2_LPSPI16_TX_EN_SHIFT    (12U)
/*! LPSPI16_TX_EN - LPSPI16 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_LPSPI16_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_LPSPI16_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_LPSPI16_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_I3C0_RX_EN_MASK        (0x2000U)
#define SYSCON0_EDMA0_EN2_I3C0_RX_EN_SHIFT       (13U)
/*! I3C0_RX_EN - I3C0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_I3C0_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_I3C0_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_I3C0_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_I3C0_TX_EN_MASK        (0x4000U)
#define SYSCON0_EDMA0_EN2_I3C0_TX_EN_SHIFT       (14U)
/*! I3C0_TX_EN - I3C0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_I3C0_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_I3C0_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_I3C0_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_I3C1_RX_EN_MASK        (0x8000U)
#define SYSCON0_EDMA0_EN2_I3C1_RX_EN_SHIFT       (15U)
/*! I3C1_RX_EN - I3C1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_I3C1_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_I3C1_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_I3C1_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_I3C1_TX_EN_MASK        (0x10000U)
#define SYSCON0_EDMA0_EN2_I3C1_TX_EN_SHIFT       (16U)
/*! I3C1_TX_EN - I3C1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_I3C1_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_I3C1_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_I3C1_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI0_RX_EN_MASK        (0x20000U)
#define SYSCON0_EDMA0_EN2_SAI0_RX_EN_SHIFT       (17U)
/*! SAI0_RX_EN - SAI0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI0_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI0_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI0_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI0_TX_EN_MASK        (0x40000U)
#define SYSCON0_EDMA0_EN2_SAI0_TX_EN_SHIFT       (18U)
/*! SAI0_TX_EN - SAI0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI0_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI0_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI0_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI1_RX_EN_MASK        (0x80000U)
#define SYSCON0_EDMA0_EN2_SAI1_RX_EN_SHIFT       (19U)
/*! SAI1_RX_EN - SAI1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI1_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI1_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI1_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI1_TX_EN_MASK        (0x100000U)
#define SYSCON0_EDMA0_EN2_SAI1_TX_EN_SHIFT       (20U)
/*! SAI1_TX_EN - SAI1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI1_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI1_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI1_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI2_RX_EN_MASK        (0x200000U)
#define SYSCON0_EDMA0_EN2_SAI2_RX_EN_SHIFT       (21U)
/*! SAI2_RX_EN - SAI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI2_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI2_RX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI2_RX_EN_MASK)

#define SYSCON0_EDMA0_EN2_SAI2_TX_EN_MASK        (0x400000U)
#define SYSCON0_EDMA0_EN2_SAI2_TX_EN_SHIFT       (22U)
/*! SAI2_TX_EN - SAI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_SAI2_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_SAI2_TX_EN_SHIFT)) & SYSCON0_EDMA0_EN2_SAI2_TX_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO0_DMA0_EN_MASK     (0x800000U)
#define SYSCON0_EDMA0_EN2_GPIO0_DMA0_EN_SHIFT    (23U)
/*! GPIO0_DMA0_EN - GPIO0 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO0_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO0_DMA0_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO0_DMA0_EN_MASK)

#define SYSCON0_EDMA0_EN2_GPIO0_DMA1_EN_MASK     (0x1000000U)
#define SYSCON0_EDMA0_EN2_GPIO0_DMA1_EN_SHIFT    (24U)
/*! GPIO0_DMA1_EN - GPIO0 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA0_EN2_GPIO0_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA0_EN2_GPIO0_DMA1_EN_SHIFT)) & SYSCON0_EDMA0_EN2_GPIO0_DMA1_EN_MASK)

