solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN0_CTIMER4_M1_EN_MASK     (0x2000000U)
#define SYSCON0_EDMA1_EN0_CTIMER4_M1_EN_SHIFT    (25U)
/*! CTIMER4_M1_EN - CTIMER4 M1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_CTIMER4_M1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_CTIMER4_M1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_CTIMER4_M1_EN_MASK)

#define SYSCON0_EDMA1_EN0_SCT0_DMAA_EN_MASK      (0x4000000U)
#define SYSCON0_EDMA1_EN0_SCT0_DMAA_EN_SHIFT     (26U)
/*! SCT0_DMAA_EN - SCT0 DMA A Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_SCT0_DMAA_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_SCT0_DMAA_EN_SHIFT)) & SYSCON0_EDMA1_EN0_SCT0_DMAA_EN_MASK)

#define SYSCON0_EDMA1_EN0_SCT0_DMAB_EN_MASK      (0x8000000U)
#define SYSCON0_EDMA1_EN0_SCT0_DMAB_EN_SHIFT     (27U)
/*! SCT0_DMAB_EN - SCT0 DMA B Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_SCT0_DMAB_EN(x)        (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_SCT0_DMAB_EN_SHIFT)) & SYSCON0_EDMA1_EN0_SCT0_DMAB_EN_MASK)

#define SYSCON0_EDMA1_EN0_ADC0_FIFO0_EN_MASK     (0x10000000U)
#define SYSCON0_EDMA1_EN0_ADC0_FIFO0_EN_SHIFT    (28U)
/*! ADC0_FIFO0_EN - ADC0 FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_ADC0_FIFO0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_ADC0_FIFO0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_ADC0_FIFO0_EN_MASK)

#define SYSCON0_EDMA1_EN0_ADC0_FIFO1_EN_MASK     (0x20000000U)
#define SYSCON0_EDMA1_EN0_ADC0_FIFO1_EN_SHIFT    (29U)
/*! ADC0_FIFO1_EN - ADC0 FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_ADC0_FIFO1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_ADC0_FIFO1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_ADC0_FIFO1_EN_MASK)

#define SYSCON0_EDMA1_EN0_SDADC_FIFO0_EN_MASK    (0x40000000U)
#define SYSCON0_EDMA1_EN0_SDADC_FIFO0_EN_SHIFT   (30U)
/*! SDADC_FIFO0_EN - SDADC FIFO0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_SDADC_FIFO0_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_SDADC_FIFO0_EN_SHIFT)) & SYSCON0_EDMA1_EN0_SDADC_FIFO0_EN_MASK)

#define SYSCON0_EDMA1_EN0_SDADC_FIFO1_EN_MASK    (0x80000000U)
#define SYSCON0_EDMA1_EN0_SDADC_FIFO1_EN_SHIFT   (31U)
/*! SDADC_FIFO1_EN - SDADC FIFO1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN0_SDADC_FIFO1_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN0_SDADC_FIFO1_EN_SHIFT)) & SYSCON0_EDMA1_EN0_SDADC_FIFO1_EN_MASK)
/*! @} */

/*! @name EDMA1_EN1 - eDMA1 Request Enable 1 */
/*! @{ */

#define SYSCON0_EDMA1_EN1_SDADC_FIFO2_EN_MASK    (0x1U)
#define SYSCON0_EDMA1_EN1_SDADC_FIFO2_EN_SHIFT   (0U)
/*! SDADC_FIFO2_EN - SDADC FIFO2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_SDADC_FIFO2_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_SDADC_FIFO2_EN_SHIFT)) & SYSCON0_EDMA1_EN1_SDADC_FIFO2_EN_MASK)

#define SYSCON0_EDMA1_EN1_SDADC_FIFO3_EN_MASK    (0x2U)
#define SYSCON0_EDMA1_EN1_SDADC_FIFO3_EN_SHIFT   (1U)
/*! SDADC_FIFO3_EN - SDADC FIFO3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_SDADC_FIFO3_EN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_SDADC_FIFO3_EN_SHIFT)) & SYSCON0_EDMA1_EN1_SDADC_FIFO3_EN_MASK)

#define SYSCON0_EDMA1_EN1_ACMP_EN_MASK           (0x4U)
#define SYSCON0_EDMA1_EN1_ACMP_EN_SHIFT          (2U)
/*! ACMP_EN - ACMP0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_ACMP_EN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_ACMP_EN_SHIFT)) & SYSCON0_EDMA1_EN1_ACMP_EN_MASK)

#define SYSCON0_EDMA1_EN1_ITRC_TAMPER0_EN_MASK   (0x8U)
#define SYSCON0_EDMA1_EN1_ITRC_TAMPER0_EN_SHIFT  (3U)
/*! ITRC_TAMPER0_EN - ITRC Tamper 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_ITRC_TAMPER0_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_ITRC_TAMPER0_EN_SHIFT)) & SYSCON0_EDMA1_EN1_ITRC_TAMPER0_EN_MASK)

#define SYSCON0_EDMA1_EN1_ITRC_TAMPER1_EN_MASK   (0x10U)
#define SYSCON0_EDMA1_EN1_ITRC_TAMPER1_EN_SHIFT  (4U)
/*! ITRC_TAMPER1_EN - ITRC Tamper 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_ITRC_TAMPER1_EN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_ITRC_TAMPER1_EN_SHIFT)) & SYSCON0_EDMA1_EN1_ITRC_TAMPER1_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER0_EN_MASK (0x20U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER0_EN_SHIFT (5U)
/*! FLEXIO_SHFT_TIMER0_EN - FLEXIO Shift Timer 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER0_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER0_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER0_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER1_EN_MASK (0x40U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER1_EN_SHIFT (6U)
/*! FLEXIO_SHFT_TIMER1_EN - FLEXIO Shift Timer 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER1_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER1_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER1_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER2_EN_MASK (0x80U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER2_EN_SHIFT (7U)
/*! FLEXIO_SHFT_TIMER2_EN - FLEXIO Shift Timer 2 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER2_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER2_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER2_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER3_EN_MASK (0x100U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER3_EN_SHIFT (8U)
/*! FLEXIO_SHFT_TIMER3_EN - FLEXIO Shift Timer 3 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER3_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER3_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER3_EN_MASK)

