solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER4_EN_MASK (0x200U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER4_EN_SHIFT (9U)
/*! FLEXIO_SHFT_TIMER4_EN - FLEXIO Shift Timer 4 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER4_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER4_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER4_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER5_EN_MASK (0x400U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER5_EN_SHIFT (10U)
/*! FLEXIO_SHFT_TIMER5_EN - FLEXIO Shift Timer 5 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER5_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER5_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER5_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER6_EN_MASK (0x800U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER6_EN_SHIFT (11U)
/*! FLEXIO_SHFT_TIMER6_EN - FLEXIO Shift Timer 6 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER6_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER6_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER6_EN_MASK)

#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER7_EN_MASK (0x1000U)
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER7_EN_SHIFT (12U)
/*! FLEXIO_SHFT_TIMER7_EN - FLEXIO Shift Timer 7 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER7_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER7_EN_SHIFT)) & SYSCON0_EDMA1_EN1_FLEXIO_SHFT_TIMER7_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_RX_EN_MASK (0x2000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_RX_EN_SHIFT (13U)
/*! LP_FLEXCOMM0_RX_EN - LP_FLEXCOMM0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_TX_EN_MASK (0x4000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_TX_EN_SHIFT (14U)
/*! LP_FLEXCOMM0_TX_EN - LP_FLEXCOMM0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM0_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_RX_EN_MASK (0x8000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_RX_EN_SHIFT (15U)
/*! LP_FLEXCOMM1_RX_EN - LP_FLEXCOMM1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_TX_EN_MASK (0x10000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_TX_EN_SHIFT (16U)
/*! LP_FLEXCOMM1_TX_EN - LP_FLEXCOMM1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM1_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_RX_EN_MASK (0x20000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_RX_EN_SHIFT (17U)
/*! LP_FLEXCOMM2_RX_EN - LP_FLEXCOMM2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_TX_EN_MASK (0x40000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_TX_EN_SHIFT (18U)
/*! LP_FLEXCOMM2_TX_EN - LP_FLEXCOMM2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM2_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_RX_EN_MASK (0x80000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_RX_EN_SHIFT (19U)
/*! LP_FLEXCOMM3_RX_EN - LP_FLEXCOMM3 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_TX_EN_MASK (0x100000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_TX_EN_SHIFT (20U)
/*! LP_FLEXCOMM3_TX_EN - LP_FLEXCOMM3 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM3_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_RX_EN_MASK (0x200000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_RX_EN_SHIFT (21U)
/*! LP_FLEXCOMM4_RX_EN - LP_FLEXCOMM4 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_TX_EN_MASK (0x400000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_TX_EN_SHIFT (22U)
/*! LP_FLEXCOMM4_TX_EN - LP_FLEXCOMM4 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM4_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_RX_EN_MASK (0x800000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_RX_EN_SHIFT (23U)
/*! LP_FLEXCOMM5_RX_EN - LP_FLEXCOMM5 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_TX_EN_MASK (0x1000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_TX_EN_SHIFT (24U)
/*! LP_FLEXCOMM5_TX_EN - LP_FLEXCOMM5 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM5_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_RX_EN_MASK (0x2000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_RX_EN_SHIFT (25U)
/*! LP_FLEXCOMM6_RX_EN - LP_FLEXCOMM6 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_TX_EN_MASK (0x4000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_TX_EN_SHIFT (26U)
/*! LP_FLEXCOMM6_TX_EN - LP_FLEXCOMM6 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM6_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_RX_EN_MASK (0x8000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_RX_EN_SHIFT (27U)
/*! LP_FLEXCOMM7_RX_EN - LP_FLEXCOMM7 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_RX_EN_MASK)

