solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_TX_EN_MASK (0x10000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_TX_EN_SHIFT (28U)
/*! LP_FLEXCOMM7_TX_EN - LP_FLEXCOMM7 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM7_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_RX_EN_MASK (0x20000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_RX_EN_SHIFT (29U)
/*! LP_FLEXCOMM8_RX_EN - LP_FLEXCOMM8 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_RX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_TX_EN_MASK (0x40000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_TX_EN_SHIFT (30U)
/*! LP_FLEXCOMM8_TX_EN - LP_FLEXCOMM8 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM8_TX_EN_MASK)

#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM9_RX_EN_MASK (0x80000000U)
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM9_RX_EN_SHIFT (31U)
/*! LP_FLEXCOMM9_RX_EN - LP_FLEXCOMM9 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN1_LP_FLEXCOMM9_RX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN1_LP_FLEXCOMM9_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN1_LP_FLEXCOMM9_RX_EN_MASK)
/*! @} */

/*! @name EDMA1_EN2 - eDMA1 Request Enable 2 */
/*! @{ */

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM9_TX_EN_MASK (0x1U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM9_TX_EN_SHIFT (0U)
/*! LP_FLEXCOMM9_TX_EN - LP_FLEXCOMM9 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM9_TX_EN(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM9_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM9_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_RX_EN_MASK (0x2U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_RX_EN_SHIFT (1U)
/*! LP_FLEXCOMM10_RX_EN - LP_FLEXCOMM10 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_TX_EN_MASK (0x4U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_TX_EN_SHIFT (2U)
/*! LP_FLEXCOMM10_TX_EN - LP_FLEXCOMM10 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM10_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_RX_EN_MASK (0x8U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_RX_EN_SHIFT (3U)
/*! LP_FLEXCOMM11_RX_EN - LP_FLEXCOMM11 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_TX_EN_MASK (0x10U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_TX_EN_SHIFT (4U)
/*! LP_FLEXCOMM11_TX_EN - LP_FLEXCOMM11 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM11_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_RX_EN_MASK (0x20U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_RX_EN_SHIFT (5U)
/*! LP_FLEXCOMM12_RX_EN - LP_FLEXCOMM12 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_TX_EN_MASK (0x40U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_TX_EN_SHIFT (6U)
/*! LP_FLEXCOMM12_TX_EN - LP_FLEXCOMM12 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM12_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_RX_EN_MASK (0x80U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_RX_EN_SHIFT (7U)
/*! LP_FLEXCOMM13_RX_EN - LP_FLEXCOMM13 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_RX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_TX_EN_MASK (0x100U)
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_TX_EN_SHIFT (8U)
/*! LP_FLEXCOMM13_TX_EN - LP_FLEXCOMM13 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_TX_EN(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LP_FLEXCOMM13_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LPSPI14_RX_EN_MASK     (0x200U)
#define SYSCON0_EDMA1_EN2_LPSPI14_RX_EN_SHIFT    (9U)
/*! LPSPI14_RX_EN - LPSPI14 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LPSPI14_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LPSPI14_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LPSPI14_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LPSPI14_TX_EN_MASK     (0x400U)
#define SYSCON0_EDMA1_EN2_LPSPI14_TX_EN_SHIFT    (10U)
/*! LPSPI14_TX_EN - LPSPI14 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LPSPI14_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LPSPI14_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LPSPI14_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LPSPI16_RX_EN_MASK     (0x800U)
#define SYSCON0_EDMA1_EN2_LPSPI16_RX_EN_SHIFT    (11U)
/*! LPSPI16_RX_EN - LPSPI16 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LPSPI16_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LPSPI16_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LPSPI16_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_LPSPI16_TX_EN_MASK     (0x1000U)
#define SYSCON0_EDMA1_EN2_LPSPI16_TX_EN_SHIFT    (12U)
/*! LPSPI16_TX_EN - LPSPI16 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_LPSPI16_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_LPSPI16_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_LPSPI16_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_I3C0_RX_EN_MASK        (0x2000U)
#define SYSCON0_EDMA1_EN2_I3C0_RX_EN_SHIFT       (13U)
/*! I3C0_RX_EN - I3C0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_I3C0_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_I3C0_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_I3C0_RX_EN_MASK)

