solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN2_I3C0_TX_EN_MASK        (0x4000U)
#define SYSCON0_EDMA1_EN2_I3C0_TX_EN_SHIFT       (14U)
/*! I3C0_TX_EN - I3C0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_I3C0_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_I3C0_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_I3C0_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_I3C1_RX_EN_MASK        (0x8000U)
#define SYSCON0_EDMA1_EN2_I3C1_RX_EN_SHIFT       (15U)
/*! I3C1_RX_EN - I3C1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_I3C1_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_I3C1_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_I3C1_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_I3C1_TX_EN_MASK        (0x10000U)
#define SYSCON0_EDMA1_EN2_I3C1_TX_EN_SHIFT       (16U)
/*! I3C1_TX_EN - I3C1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_I3C1_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_I3C1_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_I3C1_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI0_RX_EN_MASK        (0x20000U)
#define SYSCON0_EDMA1_EN2_SAI0_RX_EN_SHIFT       (17U)
/*! SAI0_RX_EN - SAI0 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI0_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI0_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI0_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI0_TX_EN_MASK        (0x40000U)
#define SYSCON0_EDMA1_EN2_SAI0_TX_EN_SHIFT       (18U)
/*! SAI0_TX_EN - SAI0 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI0_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI0_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI0_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI1_RX_EN_MASK        (0x80000U)
#define SYSCON0_EDMA1_EN2_SAI1_RX_EN_SHIFT       (19U)
/*! SAI1_RX_EN - SAI1 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI1_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI1_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI1_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI1_TX_EN_MASK        (0x100000U)
#define SYSCON0_EDMA1_EN2_SAI1_TX_EN_SHIFT       (20U)
/*! SAI1_TX_EN - SAI1 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI1_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI1_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI1_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI2_RX_EN_MASK        (0x200000U)
#define SYSCON0_EDMA1_EN2_SAI2_RX_EN_SHIFT       (21U)
/*! SAI2_RX_EN - SAI2 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI2_RX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI2_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI2_RX_EN_MASK)

#define SYSCON0_EDMA1_EN2_SAI2_TX_EN_MASK        (0x400000U)
#define SYSCON0_EDMA1_EN2_SAI2_TX_EN_SHIFT       (22U)
/*! SAI2_TX_EN - SAI2 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_SAI2_TX_EN(x)          (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_SAI2_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN2_SAI2_TX_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO0_DMA0_EN_MASK     (0x800000U)
#define SYSCON0_EDMA1_EN2_GPIO0_DMA0_EN_SHIFT    (23U)
/*! GPIO0_DMA0_EN - GPIO0 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO0_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO0_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO0_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO0_DMA1_EN_MASK     (0x1000000U)
#define SYSCON0_EDMA1_EN2_GPIO0_DMA1_EN_SHIFT    (24U)
/*! GPIO0_DMA1_EN - GPIO0 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO0_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO0_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO0_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO1_DMA0_EN_MASK     (0x2000000U)
#define SYSCON0_EDMA1_EN2_GPIO1_DMA0_EN_SHIFT    (25U)
/*! GPIO1_DMA0_EN - GPIO1 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO1_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO1_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO1_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO1_DMA1_EN_MASK     (0x4000000U)
#define SYSCON0_EDMA1_EN2_GPIO1_DMA1_EN_SHIFT    (26U)
/*! GPIO1_DMA1_EN - GPIO1 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO1_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO1_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO1_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO2_DMA0_EN_MASK     (0x8000000U)
#define SYSCON0_EDMA1_EN2_GPIO2_DMA0_EN_SHIFT    (27U)
/*! GPIO2_DMA0_EN - GPIO2 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO2_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO2_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO2_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO2_DMA1_EN_MASK     (0x10000000U)
#define SYSCON0_EDMA1_EN2_GPIO2_DMA1_EN_SHIFT    (28U)
/*! GPIO2_DMA1_EN - GPIO2 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO2_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO2_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO2_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO3_DMA0_EN_MASK     (0x20000000U)
#define SYSCON0_EDMA1_EN2_GPIO3_DMA0_EN_SHIFT    (29U)
/*! GPIO3_DMA0_EN - GPIO3 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO3_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO3_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO3_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO3_DMA1_EN_MASK     (0x40000000U)
#define SYSCON0_EDMA1_EN2_GPIO3_DMA1_EN_SHIFT    (30U)
/*! GPIO3_DMA1_EN - GPIO3 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO3_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO3_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO3_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN2_GPIO4_DMA0_EN_MASK     (0x80000000U)
#define SYSCON0_EDMA1_EN2_GPIO4_DMA0_EN_SHIFT    (31U)
/*! GPIO4_DMA0_EN - GPIO4 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN2_GPIO4_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN2_GPIO4_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN2_GPIO4_DMA0_EN_MASK)
/*! @} */

/*! @name EDMA1_EN3 - eDMA1 Request Enable 3 */
/*! @{ */

#define SYSCON0_EDMA1_EN3_GPIO4_DMA1_EN_MASK     (0x1U)
#define SYSCON0_EDMA1_EN3_GPIO4_DMA1_EN_SHIFT    (0U)
/*! GPIO4_DMA1_EN - GPIO4 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO4_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO4_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO4_DMA1_EN_MASK)

