solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_EDMA1_EN3_GPIO5_DMA0_EN_MASK     (0x2U)
#define SYSCON0_EDMA1_EN3_GPIO5_DMA0_EN_SHIFT    (1U)
/*! GPIO5_DMA0_EN - GPIO5 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO5_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO5_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO5_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN3_GPIO5_DMA1_EN_MASK     (0x4U)
#define SYSCON0_EDMA1_EN3_GPIO5_DMA1_EN_SHIFT    (2U)
/*! GPIO5_DMA1_EN - GPIO5 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO5_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO5_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO5_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN3_GPIO6_DMA0_EN_MASK     (0x8U)
#define SYSCON0_EDMA1_EN3_GPIO6_DMA0_EN_SHIFT    (3U)
/*! GPIO6_DMA0_EN - GPIO6 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO6_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO6_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO6_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN3_GPIO6_DMA1_EN_MASK     (0x10U)
#define SYSCON0_EDMA1_EN3_GPIO6_DMA1_EN_SHIFT    (4U)
/*! GPIO6_DMA1_EN - GPIO6 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO6_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO6_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO6_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN3_GPIO7_DMA0_EN_MASK     (0x20U)
#define SYSCON0_EDMA1_EN3_GPIO7_DMA0_EN_SHIFT    (5U)
/*! GPIO7_DMA0_EN - GPIO7 eDMA Request 0 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO7_DMA0_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO7_DMA0_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO7_DMA0_EN_MASK)

#define SYSCON0_EDMA1_EN3_GPIO7_DMA1_EN_MASK     (0x40U)
#define SYSCON0_EDMA1_EN3_GPIO7_DMA1_EN_SHIFT    (6U)
/*! GPIO7_DMA1_EN - GPIO7 eDMA Request 1 Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_GPIO7_DMA1_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_GPIO7_DMA1_EN_SHIFT)) & SYSCON0_EDMA1_EN3_GPIO7_DMA1_EN_MASK)

#define SYSCON0_EDMA1_EN3_LPI2C15_RX_EN_MASK     (0x80U)
#define SYSCON0_EDMA1_EN3_LPI2C15_RX_EN_SHIFT    (7U)
/*! LPI2C15_RX_EN - LPI2C15 RX FIFO Drain Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_LPI2C15_RX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_LPI2C15_RX_EN_SHIFT)) & SYSCON0_EDMA1_EN3_LPI2C15_RX_EN_MASK)

#define SYSCON0_EDMA1_EN3_LPI2C15_TX_EN_MASK     (0x100U)
#define SYSCON0_EDMA1_EN3_LPI2C15_TX_EN_SHIFT    (8U)
/*! LPI2C15_TX_EN - LPI2C15 TX FIFO Fill Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define SYSCON0_EDMA1_EN3_LPI2C15_TX_EN(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_EDMA1_EN3_LPI2C15_TX_EN_SHIFT)) & SYSCON0_EDMA1_EN3_LPI2C15_TX_EN_MASK)
/*! @} */

/*! @name AXBS_CTRL - AXBS Control */
/*! @{ */

#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M0_MASK (0x1U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M0_SHIFT (0U)
/*! AXBS_XSPI0_PRIORITY_M0 - AXBS for XSPI0 M0 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M0_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M0_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M1_MASK (0x2U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M1_SHIFT (1U)
/*! AXBS_XSPI0_PRIORITY_M1 - AXBS for XSPI0 M1 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M1_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M1_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M2_MASK (0x4U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M2_SHIFT (2U)
/*! AXBS_XSPI0_PRIORITY_M2 - AXBS for XSPI0 M2 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M2_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI0_PRIORITY_M2_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_MASK (0x8000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_SHIFT (15U)
/*! AXBS_XSPI0_FORCE_RR - AXBS for XSPI0 Force Round-Robin
 *  0b0..Fixed priority arbitration
 *  0b1..Round-robin arbitration
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI0_FORCE_RR_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_MASK (0x10000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_SHIFT (16U)
/*! AXBS_XSPI1_PRIORITY_M0 - AXBS for XSPI1 M0 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M0_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_MASK (0x20000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_SHIFT (17U)
/*! AXBS_XSPI1_PRIORITY_M1 - AXBS for XSPI1 M1 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M1_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_MASK (0x40000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_SHIFT (18U)
/*! AXBS_XSPI1_PRIORITY_M2 - AXBS for XSPI1 M2 Priority
 *  0b0..Low
 *  0b1..High
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_PRIORITY_M2_MASK)

#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_MASK (0x80000000U)
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_SHIFT (31U)
/*! AXBS_XSPI1_FORCE_RR - AXBS for XSPI1 Force Round-Robin
 *  0b0..Fixed priority arbitration
 *  0b1..Round-robin arbitration
 */
#define SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_SHIFT)) & SYSCON0_AXBS_CTRL_AXBS_XSPI1_FORCE_RR_MASK)
/*! @} */

/*! @name I3C_ASYNC_WAKEUP_CTRL - I3C Asynchronous Wake-up Control */
/*! @{ */

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_MASK (0x1U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_SHIFT (0U)
/*! IRQ_EN0 - I3C0 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN0_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_MASK (0x2U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_SHIFT (1U)
/*! IRQ_CLR0 - I3C0 Asynchronous Wake-up Interrupt Clear
 *  0b0..Interrupt not cleared
 *  0b1..Interrupt cleared
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR0_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_MASK (0x80U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_SHIFT (7U)
/*! IRQ_STATUS0 - I3C0 Asynchronous Wake-up Interrupt Status
 *  0b0..Interrupt not asserted
 *  0b1..Interrupt asserted
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS0_MASK)

