solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_MASK (0x100U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_SHIFT (8U)
/*! IRQ_EN1 - I3C1 Controller Mode Asynchronous Wake-up Interrupt Enable
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_EN1_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_MASK (0x200U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_SHIFT (9U)
/*! IRQ_CLR1 - I3C1 Asynchronous Wake-up Interrupt Clear
 *  0b0..Interrupt not cleared
 *  0b1..Interrupt cleared
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_CLR1_MASK)

#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_MASK (0x8000U)
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_SHIFT (15U)
/*! IRQ_STATUS1 - I3C1 Asynchronous Wake-up Interrupt Status
 *  0b0..Interrupt disabled
 *  0b1..Interrupt enabled
 */
#define SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_SHIFT)) & SYSCON0_I3C_ASYNC_WAKEUP_CTRL_IRQ_STATUS1_MASK)
/*! @} */

/*! @name GRAY_CODE_LSB - Gray to Binary Converter - Gray Code [31:0] */
/*! @{ */

#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK (0xFFFFFFFFU)
#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT (0U)
/*! CODE_GRAY_31_0 - Gray Code [31:0] */
#define SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_SHIFT)) & SYSCON0_GRAY_CODE_LSB_CODE_GRAY_31_0_MASK)
/*! @} */

/*! @name GRAY_CODE_MSB - Gray to Binary Converter - Gray Code [63:32] */
/*! @{ */

#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_MASK (0xFFFFFFFFU)
#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_SHIFT (0U)
/*! CODE_GRAY_63_32 - Gray Code [63:32] */
#define SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_SHIFT)) & SYSCON0_GRAY_CODE_MSB_CODE_GRAY_63_32_MASK)
/*! @} */

/*! @name BINARY_CODE_LSB - Gray to Binary Converter - Binary Code [31:0] */
/*! @{ */

#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_MASK (0xFFFFFFFFU)
#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT (0U)
/*! CODE_BIN_31_0 - Binary Code [31:0] */
#define SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_SHIFT)) & SYSCON0_BINARY_CODE_LSB_CODE_BIN_31_0_MASK)
/*! @} */

/*! @name BINARY_CODE_MSB - Gray to Binary Converter - Binary Code [63:32] */
/*! @{ */

#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_MASK (0xFFFFFFFFU)
#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_SHIFT (0U)
/*! CODE_BIN_63_32 - Binary Code [63:32] */
#define SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_SHIFT)) & SYSCON0_BINARY_CODE_MSB_CODE_BIN_63_32_MASK)
/*! @} */

/*! @name SEC_BUSY_STATE - Secure IP Busy State */
/*! @{ */

#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_MASK    (0x1U)
#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_SHIFT   (0U)
/*! SAFO_BUSY - SAFO-SGI Busy State
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SYSCON0_SEC_BUSY_STATE_SAFO_BUSY(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_SHIFT)) & SYSCON0_SEC_BUSY_STATE_SAFO_BUSY_MASK)

#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY_MASK     (0x2U)
#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY_SHIFT    (1U)
/*! ELS_BUSY - ELS Busy State
 *  0b0..Not busy
 *  0b1..Busy
 */
#define SYSCON0_SEC_BUSY_STATE_ELS_BUSY(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_SEC_BUSY_STATE_ELS_BUSY_SHIFT)) & SYSCON0_SEC_BUSY_STATE_ELS_BUSY_MASK)
/*! @} */

/*! @name ELS_OTP_LC_STATE - Lifecycle State */
/*! @{ */

#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK (0xFFU)
#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT (0U)
/*! OTP_LC_STATE - OTP Lifecycle State */
#define SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_SHIFT)) & SYSCON0_ELS_OTP_LC_STATE_OTP_LC_STATE_MASK)
/*! @} */

/*! @name ELS_OTP_LC_STATE_DP - Lifecycle State */
/*! @{ */

#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK (0xFFU)
#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT (0U)
/*! OTP_LC_STATE_DP - OTP Lifecycle State */
#define SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_SHIFT)) & SYSCON0_ELS_OTP_LC_STATE_DP_OTP_LC_STATE_DP_MASK)
/*! @} */

/*! @name ELS_TEMPORAL_STATE - ELS Temporal State */
/*! @{ */

#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_MASK (0xFU)
#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_SHIFT (0U)
/*! TEMPORAL_STATE - Temporal State */
#define SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_SHIFT)) & SYSCON0_ELS_TEMPORAL_STATE_TEMPORAL_STATE_MASK)
/*! @} */

/*! @name ELS_KDF_MASK - Key Derivation Function Mask */
/*! @{ */

#define SYSCON0_ELS_KDF_MASK_KDF_MASK_MASK       (0xFFFFFFFFU)
#define SYSCON0_ELS_KDF_MASK_KDF_MASK_SHIFT      (0U)
/*! KDF_MASK - Key Derivation Function Mask */
#define SYSCON0_ELS_KDF_MASK_KDF_MASK(x)         (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_KDF_MASK_KDF_MASK_SHIFT)) & SYSCON0_ELS_KDF_MASK_KDF_MASK_MASK)
/*! @} */

/*! @name ELS_BOOT_STATE1 - ELS Boot State 1 */
/*! @{ */

#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_MASK (0x3U)
#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_SHIFT (0U)
/*! ROOT_KEY_INDEX - Root Key Index */
#define SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_ROOT_KEY_INDEX_MASK)

#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_MASK (0x3FCU)
#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_SHIFT (2U)
/*! FIPS_SELF_TEST - FIPS Self-Test
 *  0b00000010..FIPS_SHA_STEN
 *  0b00000011..FIPS_AES_STEN
 *  0b00000100..FIPS_ECDSA_STEN
 *  0b00000101..FIPS_DRBG_STEN
 *  0b00000110..FIPS_CMAC_STEN
 *  0b00000111..FIPS_CKDF_STEN
 *  0b00001000..FIPS_HKDF_STEN
 *  0b00001001..
 */
#define SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_FIPS_SELF_TEST_MASK)

#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP_MASK     (0xC00U)
#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP_SHIFT    (10U)
/*! SB3_TYP - SB3 Type
 *  0b00..Customer firmware load and update file
 *  0b01..NXP provisioning firmware
 *  0b10..Customer manufacturing firmware (device HSM)
 */
#define SYSCON0_ELS_BOOT_STATE1_SB3_TYP(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_SB3_TYP_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_SB3_TYP_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_MASK (0x3000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_SHIFT (12U)
/*! PMC0_FLAGS_19_18 - PMC0.FLAGS[19:18] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_19_18_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_MASK (0x18000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_SHIFT (15U)
/*! PMC0_FLAGS_22_21 - PMC0.FLAGS[22:21] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_22_21_MASK)

#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_MASK (0xC0000U)
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_SHIFT (18U)
/*! PMC0_FLAGS_17_16 - PMC0.FLAGS[17:16] */
#define SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_SHIFT)) & SYSCON0_ELS_BOOT_STATE1_PMC0_FLAGS_17_16_MASK)
/*! @} */

