solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
/*! @name ELS_ASSET_PROT - ELS Asset Protection */
/*! @{ */

#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_MASK (0x3U)
#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_SHIFT (0U)
/*! ASSET_PROTECTION - Asset Protection
 *  0b01..NOT protected
 *  *..Protected
 */
#define SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_SHIFT)) & SYSCON0_ELS_ASSET_PROT_ASSET_PROTECTION_MASK)
/*! @} */

/*! @name ELS_AS_UUID - ELS AS UUID */
/*! @{ */

#define SYSCON0_ELS_AS_UUID_UUIDN_MASK           (0xFFFFFFFFU)
#define SYSCON0_ELS_AS_UUID_UUIDN_SHIFT          (0U)
/*! UUIDN - UUIDn 32-Bit Data Register */
#define SYSCON0_ELS_AS_UUID_UUIDN(x)             (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_UUID_UUIDN_SHIFT)) & SYSCON0_ELS_AS_UUID_UUIDN_MASK)
/*! @} */

/*! @name ELS_AS_CFG0 - ELS AS Configuration 0 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_MASK    (0xFFU)
#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_SHIFT   (0U)
/*! CFG_LC_STATE - Lifecycle State Configuration */
#define SYSCON0_ELS_AS_CFG0_CFG_LC_STATE(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LC_STATE_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_MASK (0x100U)
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_SHIFT (8U)
/*! CFG_HVD_VDD1_ENABLED - HVD for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_MASK (0x200U)
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_SHIFT (9U)
/*! CFG_LVD_VDD1_ENABLED - LVD for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_MASK (0x400U)
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_SHIFT (10U)
/*! CFG_HVD_VDD2_ENABLED - HVD for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_HVD_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_MASK (0x800U)
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_SHIFT (11U)
/*! CFG_LVD_VDD2_ENABLED - LVD for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_LVD_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_MASK (0x1000U)
#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_SHIFT (12U)
/*! CFG_VDD2_HGDET0_ENABLED - VDD2 High-Range GDET0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_VDD2_HGDET0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_MASK (0x8000U)
#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_SHIFT (15U)
/*! CFG_VDD1_HGDET3_ENABLED - VDD1 High-Range GDET3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_VDD1_HGDET3_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_MASK (0x10000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_SHIFT (16U)
/*! CFG_WWDT0_ENABLED - WWDT0 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_MASK (0x20000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_SHIFT (17U)
/*! CFG_WWDT1_ENABLED - WWDT1 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_MASK (0x40000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_SHIFT (18U)
/*! CFG_WWDT2_ENABLED - WWDT2 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_MASK (0x80000U)
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_SHIFT (19U)
/*! CFG_WWDT3_ENABLED - WWDT3 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_WWDT3_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_MASK (0x100000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_SHIFT (20U)
/*! CFG_CDOG0_ENABLED - CDOG0 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG0_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_MASK (0x200000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_SHIFT (21U)
/*! CFG_CDOG1_ENABLED - CDOG1 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_MASK (0x400000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_SHIFT (22U)
/*! CFG_CDOG2_ENABLED - CDOG2 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_MASK (0x800000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_SHIFT (23U)
/*! CFG_CDOG3_ENABLED - CDOG3 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG3_ENABLED_MASK)

