solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_MASK (0x1000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_SHIFT (24U)
/*! CFG_CDOG4_ENABLED - CDOG4 Configuration
 *  0b0..Not activated
 *  0b1..Activated
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CDOG4_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_MASK (0x2000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_SHIFT (25U)
/*! CFG_AGLITCH_VDD1_ENABLED - Analog Glitch Detector for VDD1 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD1_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_MASK (0x4000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_SHIFT (26U)
/*! CFG_AGLITCH_VDD2_ENABLED - Analog Glitch Detector for VDD2 Power Rail
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_AGLITCH_VDD2_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_MASK (0x8000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_SHIFT (27U)
/*! CFG_CLKTAMPER_DET_ENABLED - Clock Tamper Detector in OSC32KNP for 32 kHz RTC XTAL Clock
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_CLKTAMPER_DET_ENABLED_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_MASK (0x10000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_SHIFT (28U)
/*! CFG_PUF_DISABLE_ENROLL - PUF Disable Enroll */
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_ENROLL_MASK)

#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_MASK (0x20000000U)
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_SHIFT (29U)
/*! CFG_PUF_DISABLE_WRAP - PUF Disable Wrap */
#define SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_SHIFT)) & SYSCON0_ELS_AS_CFG0_CFG_PUF_DISABLE_WRAP_MASK)
/*! @} */

/*! @name ELS_AS_CFG1 - ELS AS Configuration 1 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_MASK (0x1U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_SHIFT (0U)
/*! CFG_CSEC_DIS_STRICT_MODE - Disable Strict Mode in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_STRICT_MODE_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_MASK (0x2U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_SHIFT (1U)
/*! CFG_CSEC_DIS_VIOL_ABORT - Disable Violation Abort in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_DIS_VIOL_ABORT_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_MASK (0x4U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_SHIFT (2U)
/*! CFG_CSEC_ENA_NS_PRIV_CHK - Enable Non-Secure Privacy Check in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_NS_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_MASK (0x8U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_SHIFT (3U)
/*! CFG_CSEC_ENA_S_PRIV_CHK - Enable Secure Privacy Check in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_S_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_SEC_CHK_MASK (0x10U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_SEC_CHK_SHIFT (4U)
/*! CFG_CSEC_ENA_SEC_CHK - Enable Security Check in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_SEC_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_SEC_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_ENA_SEC_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_IDAU_ALLNS_MASK (0x20U)
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_IDAU_ALLNS_SHIFT (5U)
/*! CFG_CSEC_IDAU_ALLNS - IDAU All Non-Secure in VDD2_COMP Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_CSEC_IDAU_ALLNS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CSEC_IDAU_ALLNS_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CSEC_IDAU_ALLNS_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_MPU_MASK (0x40U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_MPU_SHIFT (6U)
/*! CFG_CPU0_LOCK_NS_MPU - CPU0 Lock Non-Secure MPU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_MPU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_MPU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_MPU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_VTOR_MASK (0x80U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_VTOR_SHIFT (7U)
/*! CFG_CPU0_LOCK_NS_VTOR - CPU0 Lock Non-Secure VTOR */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_VTOR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_VTOR_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_NS_VTOR_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_MPU_MASK (0x100U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_MPU_SHIFT (8U)
/*! CFG_CPU0_LOCK_S_MPU - CPU0 Lock Secure MPU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_MPU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_MPU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_MPU_MASK)

