solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_VTAIRCR_MASK (0x200U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_VTAIRCR_SHIFT (9U)
/*! CFG_CPU0_LOCK_S_VTAIRCR - CPU0 Lock Secure VTAIRCR */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_VTAIRCR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_VTAIRCR_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_S_VTAIRCR_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_SAU_MASK (0x400U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_SAU_SHIFT (10U)
/*! CFG_CPU0_LOCK_SAU - CPU0 Lock SAU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_SAU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_SAU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU0_LOCK_SAU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_STRICT_MODE_MASK (0x800U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_STRICT_MODE_SHIFT (11U)
/*! CFG_SSEC_DIS_STRICT_MODE - Disable Strict Mode in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_STRICT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_STRICT_MODE_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_STRICT_MODE_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_VIOL_ABORT_MASK (0x1000U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_VIOL_ABORT_SHIFT (12U)
/*! CFG_SSEC_DIS_VIOL_ABORT - Disable Violation Abort in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_VIOL_ABORT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_VIOL_ABORT_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_DIS_VIOL_ABORT_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_NS_PRIV_CHK_MASK (0x2000U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_NS_PRIV_CHK_SHIFT (13U)
/*! CFG_SSEC_ENA_NS_PRIV_CHK - Enable Non-Secure Privacy Check in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_NS_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_NS_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_NS_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_S_PRIV_CHK_MASK (0x4000U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_S_PRIV_CHK_SHIFT (14U)
/*! CFG_SSEC_ENA_S_PRIV_CHK - Enable Secure Privacy Check in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_S_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_S_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_S_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_SEC_CHK_MASK (0x8000U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_SEC_CHK_SHIFT (15U)
/*! CFG_SSEC_ENA_SEC_CHK - Enable Security Check in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_SEC_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_SEC_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_ENA_SEC_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_IDAU_ALLNS_MASK (0x10000U)
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_IDAU_ALLNS_SHIFT (16U)
/*! CFG_SSEC_IDAU_ALLNS - IDAU All Non-Secure in VDD1_SENSE Domain */
#define SYSCON0_ELS_AS_CFG1_CFG_SSEC_IDAU_ALLNS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_SSEC_IDAU_ALLNS_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_SSEC_IDAU_ALLNS_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_MPU_MASK (0x20000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_MPU_SHIFT (17U)
/*! CFG_CPU1_LOCK_NS_MPU - CPU1 Lock Non-Secure MPU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_MPU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_MPU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_MPU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_VTOR_MASK (0x40000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_VTOR_SHIFT (18U)
/*! CFG_CPU1_LOCK_NS_VTOR - CPU1 Lock Non-Secure VTOR */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_VTOR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_VTOR_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_NS_VTOR_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_MPU_MASK (0x80000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_MPU_SHIFT (19U)
/*! CFG_CPU1_LOCK_S_MPU - CPU1 Lock Secure MPU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_MPU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_MPU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_MPU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_MASK (0x100000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_SHIFT (20U)
/*! CFG_CPU1_LOCK_S_VTAIRCR - CPU1 Lock Secure VTAIRCR */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_S_VTAIRCR_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_MASK (0x200000U)
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_SHIFT (21U)
/*! CFG_CPU1_LOCK_SAU - CPU1 Lock SAU */
#define SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_CPU1_LOCK_SAU_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_MASK (0x400000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_SHIFT (22U)
/*! CFG_MSEC_DIS_STRICT_MODE - Disable Strict Mode in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_STRICT_MODE_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_MASK (0x800000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_SHIFT (23U)
/*! CFG_MSEC_DIS_VIOL_ABORT - Disable Violation Abort in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_DIS_VIOL_ABORT_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_MASK (0x1000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_SHIFT (24U)
/*! CFG_MSEC_ENA_NS_PRIV_CHK - Enable Non-Secure Privacy Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_NS_PRIV_CHK_MASK)

