solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_MASK (0x2000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_SHIFT (25U)
/*! CFG_MSEC_ENA_S_PRIV_CHK - Enable Secure Privacy Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_S_PRIV_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_MASK (0x4000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_SHIFT (26U)
/*! CFG_MSEC_ENA_SEC_CHK - Enable Security Check in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_ENA_SEC_CHK_MASK)

#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_MASK (0x8000000U)
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_SHIFT (27U)
/*! CFG_MSEC_IDAU_ALLNS - IDAU All Non-Secure in VDD2_MEDIA */
#define SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_SHIFT)) & SYSCON0_ELS_AS_CFG1_CFG_MSEC_IDAU_ALLNS_MASK)
/*! @} */

/*! @name ELS_AS_CFG3 - ELS AS Configuration 3 */
/*! @{ */

#define SYSCON0_ELS_AS_CFG3_METAL_VERSION_MASK   (0xF0000U)
#define SYSCON0_ELS_AS_CFG3_METAL_VERSION_SHIFT  (16U)
/*! METAL_VERSION - Metal version */
#define SYSCON0_ELS_AS_CFG3_METAL_VERSION(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_METAL_VERSION_SHIFT)) & SYSCON0_ELS_AS_CFG3_METAL_VERSION_MASK)

#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_MASK   (0xF00000U)
#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_SHIFT  (20U)
/*! ROM_MINOR_VER - ROM minor version */
#define SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_SHIFT)) & SYSCON0_ELS_AS_CFG3_ROM_MINOR_VER_MASK)

#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_MASK (0xF000000U)
#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_SHIFT (24U)
/*! ROM_PATCH_MFG_VERSION - ROM major version */
#define SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_SHIFT)) & SYSCON0_ELS_AS_CFG3_ROM_PATCH_MFG_VERSION_MASK)

#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_MASK (0xF0000000U)
#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_SHIFT (28U)
/*! PATCH_OTA_VERSION_HEXCODE - Patch version */
#define SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_SHIFT)) & SYSCON0_ELS_AS_CFG3_PATCH_OTA_VERSION_HEXCODE_MASK)
/*! @} */

/*! @name ELS_AS_ST0 - ELS AS State 0 */
/*! @{ */

#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_MASK (0xFU)
#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_SHIFT (0U)
/*! ST_TEMPORAL_STATE - Temporal State */
#define SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE(x)  (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_TEMPORAL_STATE_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_MASK    (0x10U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_SHIFT   (4U)
/*! ST_CPU0_DBGEN - CPU0 Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_MASK    (0x20U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_SHIFT   (5U)
/*! ST_CPU0_NIDEN - CPU0 Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_MASK   (0x40U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_SHIFT  (6U)
/*! ST_CPU0_SPIDEN - CPU0 Secure Privileged Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_MASK  (0x80U)
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_SHIFT (7U)
/*! ST_CPU0_SPNIDEN - CPU0 Secure Privileged Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU0_SPNIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_MASK    (0x100U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_SHIFT   (8U)
/*! ST_CPU1_DBGEN - CPU1 Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_MASK    (0x200U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_SHIFT   (9U)
/*! ST_CPU1_NIDEN - CPU1 Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_MASK   (0x400U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_SHIFT  (10U)
/*! ST_CPU1_SPIDEN - CPU1 Secure Privileged Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_MASK  (0x800U)
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_SHIFT (11U)
/*! ST_CPU1_SPNIDEN - CPU1 Secure Privileged Non-Invasive Debug State */
#define SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CPU1_SPNIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_MASK   (0x1000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_SHIFT  (12U)
/*! ST_HIFI4_DBGEN - HiFi4 Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI4_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_MASK   (0x2000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_SHIFT  (13U)
/*! ST_HIFI4_NIDEN - HiFi4 Non-Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI4_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_MASK   (0x4000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_SHIFT  (14U)
/*! ST_HIFI1_DBGEN - HiFi1 Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI1_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_MASK   (0x8000U)
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_SHIFT  (15U)
/*! ST_HIFI1_NIDEN - HiFi1 Non-Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_HIFI1_NIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_MASK   (0x10000U)
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_SHIFT  (16U)
/*! ST_AHBAP_DBGEN - Non-Secure Memory Space Access through AHB-AP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN(x)     (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_AHBAP_DBGEN_MASK)

