solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_MASK  (0x20000U)
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_SHIFT (17U)
/*! ST_AHBAP_SPIDEN - Secure Memory Space Access through AHB-AP
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_AHBAP_SPIDEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_MASK    (0x40000U)
#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_SHIFT   (18U)
/*! ST_EZHV_DBGEN - EZH-V Invasive Debug Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN(x)      (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_EZHV_DBGEN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_MASK  (0x80000U)
#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_SHIFT (19U)
/*! ST_CORESIGHT_EN - CoreSight Debug Components Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_CORESIGHT_EN_MASK)

#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_MASK (0x100000U)
#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_SHIFT (20U)
/*! ST_TEST_ACCES_EN - Test Port Access
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_SHIFT)) & SYSCON0_ELS_AS_ST0_ST_TEST_ACCES_EN_MASK)
/*! @} */

/*! @name ELS_AS_ST1 - ELS AS State 1 */
/*! @{ */

#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_MASK     (0xFU)
#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_SHIFT    (0U)
/*! ST_PUF_SCORE - PUF Score State */
#define SYSCON0_ELS_AS_ST1_ST_PUF_SCORE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_PUF_SCORE_MASK)

#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_MASK  (0x10U)
#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_SHIFT (4U)
/*! ST_PUF_ZEROIZED - PUF Zeroization State */
#define SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED(x)    (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_PUF_ZEROIZED_MASK)

#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_MASK (0x20U)
#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_SHIFT (5U)
/*! ST_MAIN_CLK_IS_EXT - Main Clock Source External */
#define SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_MAIN_CLK_IS_EXT_MASK)

#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_MASK     (0xC00U)
#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_SHIFT    (10U)
/*! ST_BOOT_MODE - Boot Mode Setting */
#define SYSCON0_ELS_AS_ST1_ST_BOOT_MODE(x)       (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_SHIFT)) & SYSCON0_ELS_AS_ST1_ST_BOOT_MODE_MASK)
/*! @} */

/*! @name ELS_AS_FLAG0 - ELS AS Flag 0 */
/*! @{ */

#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_MASK (0x1U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_SHIFT (0U)
/*! FLAG_AP_ENABLE_CPU0 - CPU0 AP0 Enable
 *  0b0..No such event
 *  0b1..DAP enables AP0 for CPU0 (Cortex-M33) debug access
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU0_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_MASK (0x2U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_SHIFT (1U)
/*! FLAG_AP_ENABLE_CPU1 - CPU1 AP1 Enable
 *  0b0..No such event
 *  0b1..DAP enables AP1 for CPU1 (Cortex-M33) debug access
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AP_ENABLE_CPU1_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_MASK (0x4U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_SHIFT (2U)
/*! FLAG_AHBAP_ENABLE - AHB-AP Enable
 *  0b0..No such event
 *  0b1..DAP enables AHB-AP for memory access through SWD interface
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_AHBAP_ENABLE_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_MASK (0x8U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_SHIFT (3U)
/*! FLAG_APBAP_ENABLE - APB-AP Enable
 *  0b0..No such event
 *  0b1..DAP enables APB-AP for debug access of HiFi4, HiFi1 or EZH-V
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_APBAP_ENABLE_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_MASK (0x10U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_SHIFT (4U)
/*! FLAG_LVD_VDD1_OCCURED - VDD1 LVD Event
 *  0b0..No such event
 *  0b1..LVD from VDD1 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD1_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_MASK (0x20U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_SHIFT (5U)
/*! FLAG_HVD_VDD1_OCCURED - VDD1 HVD Event
 *  0b0..No such event
 *  0b1..HVD from VDD1 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD1_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_MASK (0x40U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_SHIFT (6U)
/*! FLAG_LVD_VDD2_OCCURED - VDD2 LVD Event
 *  0b0..No such event
 *  0b1..LVD from VDD2 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_LVD_VDD2_OCCURED_MASK)

