solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_SYSCON0.h
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_MASK (0x80U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_SHIFT (7U)
/*! FLAG_HVD_VDD2_OCCURED - VDD2 HVD Event
 *  0b0..No such event
 *  0b1..HVD from VDD2 power rail is triggered
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_HVD_VDD2_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_MASK (0x1000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_SHIFT (12U)
/*! FLAG_PUF_ERROR - PUF Error
 *  0b0..No such event
 *  0b1..Error is flagged from PUF block
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR(x)   (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_PUF_ERROR_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_MASK (0x2000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_SHIFT (13U)
/*! FLAG_GDET_GLITCH_VDD1_DETECTED - VDD1 aGDET Glitch Detected
 *  0b0..No such event
 *  0b1..aGDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD1_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_MASK (0x4000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_SHIFT (14U)
/*! FLAG_GDET_GLITCH_VDD2_DETECTED - VDD2 aGDET Glitch Detected
 *  0b0..No such event
 *  0b1..aGDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_GDET_GLITCH_VDD2_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_MASK (0x8000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_SHIFT (15U)
/*! FLAG_ANA_GLITCH_VDD1_DETECTED - VDD1 Analog Glitch Detected
 *  0b0..No such event
 *  0b1..Analog GDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD1_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_MASK (0x10000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_SHIFT (16U)
/*! FLAG_ANA_GLITCH_VDD2_DETECTED - VDD2 Analog Glitch Detected
 *  0b0..No such event
 *  0b1..Analog GDET error is flagged
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_ANA_GLITCH_VDD2_DETECTED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_MASK (0x20000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_SHIFT (17U)
/*! FLAG_CSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD2_COMP Domain
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC0
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_MASK (0x40000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_SHIFT (18U)
/*! FLAG_SSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD1_SENSE Domain
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC3
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_SSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_MASK (0x80000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_SHIFT (19U)
/*! FLAG_MSEC_VIOL_IRQ_OCURRED - Security Violation Interrupt in VDD2_MEDIA
 *  0b0..No such event
 *  0b1..Security violation is indicated from AHBSC4
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_MSEC_VIOL_IRQ_OCURRED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_MASK (0x100000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_SHIFT (20U)
/*! FLAG_CPU0_NS_C_ACC_OCCURED - CPU0 Non-Secure Code Access
 *  0b0..No such event
 *  0b1..CPU0 (Cortex-M33) makes non-secure code transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_C_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_MASK (0x200000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_SHIFT (21U)
/*! FLAG_CPU0_NS_D_ACC_OCCURED - CPU0 Non-Secure Data Access
 *  0b0..No such event
 *  0b1..CPU0 (Cortex-M33) makes non-secure data transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU0_NS_D_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_MASK (0x400000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_SHIFT (22U)
/*! FLAG_CPU1_NS_C_ACC_OCCURED - CPU1 Non-Secure Code Access
 *  0b0..No such event
 *  0b1..CPU1 (Cortex-M33) makes non-secure code transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_C_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_MASK (0x800000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_SHIFT (23U)
/*! FLAG_CPU1_NS_D_ACC_OCCURED - CPU1 Non-Secure Data Access
 *  0b0..No such event
 *  0b1..CPU1 (Cortex-M33) makes non-secure data transactions
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CPU1_NS_D_ACC_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_MASK (0x1000000U)
#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_SHIFT (24U)
/*! OTPC_EFUSE_O_ATTACK_DETECT - OTPC E-Fuse Output Attack Detect */
#define SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_SHIFT)) & SYSCON0_ELS_AS_FLAG0_OTPC_EFUSE_O_ATTACK_DETECT_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_MASK (0x2000000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_SHIFT (25U)
/*! FLAG_CLKTAMPER_DET_IRQ_OCCURED - Clock Tamper Flag
 *  0b0..No detected
 *  0b1..Detected
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_CLKTAMPER_DET_IRQ_OCCURED_MASK)

#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_MASK (0x4000000U)
#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_SHIFT (26U)
/*! FLAG_TEMPTAMPER_DET_IRQ_OCCURED - Temperature Tamper Flag
 *  0b0..No detected
 *  0b1..Detected
 */
#define SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED(x) (((uint32_t)(((uint32_t)(x)) << SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_SHIFT)) & SYSCON0_ELS_AS_FLAG0_FLAG_TEMPTAMPER_DET_IRQ_OCCURED_MASK)
/*! @} */

